# FabricWireItem Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricWireItem Class
Members See Also
---
Provides implementation for FabricWires stored in a Custom Fabric Sheet
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public class FabricWireItem : IDisposable
```

Visual Basic
---
```text
Public Class FabricWireItem _
	Implements IDisposable
```

Visual C++
---
```text
public ref class FabricWireItem : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Structure..::..FabricWireItem
# See Also
FabricWireItem Members
Autodesk.Revit.DB.Structure Namespace